# PhaseLabel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..PhaseLabel Property
ElectricalSystem Class See Also
---
The circuit phase label used in the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public string PhaseLabel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PhaseLabel As String
	Get
```

Visual C++
---
```text
public:
property String^ PhaseLabel {
	String^ get ();
}
```

# Remarks
This property is used to retrieve the phase label of the Electrical System on a panel.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace